<h1 id="tocheading">Table of Contents</h1>
<div id="toc"></div>

In [1]:
%%javascript
$.getScript('https://kmahelona.github.io/ipython_notebook_goodies/ipython_notebook_toc.js')

### 1112. Highest Grade For Each Student

Table: Enrollments
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| student_id    | int     |
| course_id     | int     |
| grade         | int     |
+---------------+---------+
(student_id, course_id) is the primary key of this table.

Write a SQL query to find the highest grade with its corresponding course for each student. In case of a tie, you should find the course with the smallest course_id. The output must be sorted by increasing student_id.
The query result format is in the following example:
Enrollments table:
+------------+-------------------+
| student_id | course_id | grade |
+------------+-----------+-------+
| 2          | 2         | 95    |
| 2          | 3         | 95    |
| 1          | 1         | 90    |
| 1          | 2         | 99    |
| 3          | 1         | 80    |
| 3          | 2         | 75    |
| 3          | 3         | 82    |
+------------+-----------+-------+
Result table:
+------------+-------------------+
| student_id | course_id | grade |
+------------+-----------+-------+
| 1          | 2         | 99    |
| 2          | 2         | 95    |
| 3          | 3         | 82    |
+------------+-----------+-------+

```mysql
-- MYSQL
SELECT student_id, MIN(course_id) AS course_id, grade
FROM (
    SELECT e.student_id, e.course_id, e.grade
    FROM enrollments e
    JOIN (
        SELECT student_id, MAX(grade) AS grade
        FROM enrollments
        GROUP BY student_id) x
    ON e.student_id=x.student_id AND e.grade=x.grade) y
GROUP BY student_id, grade
ORDER BY student_id

-- SQL server
SELECT student_id, course_id, grade
FROM
(SELECT student_id, course_id, grade,
    RANK() OVER (partition by student_id ORDER BY grade DESC, course_id) rnk
    FROM enrollments
) X
WHERE rnk=1
ORDER BY student_id
```

### 1113. Reported Posts

Table: Actions
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| user_id       | int     |
| post_id       | int     |
| action_date   | date    | 
| action        | enum    |
| extra         | varchar |
+---------------+---------+
There is no primary key for this table, it may have duplicate rows.
The action column is an ENUM type of ('view', 'like', 'reaction', 'comment', 'report', 'share').
The extra column has optional information about the action such as a reason for report or a type of reaction. 

Write an SQL query that reports the number of posts reported yesterday for each report reason. Assume today is 2019-07-05.
The query result format is in the following example:
Actions table:
+---------+---------+-------------+--------+--------+
| user_id | post_id | action_date | action | extra  |
+---------+---------+-------------+--------+--------+
| 1       | 1       | 2019-07-01  | view   | null   |
| 1       | 1       | 2019-07-01  | like   | null   |
| 1       | 1       | 2019-07-01  | share  | null   |
| 2       | 4       | 2019-07-04  | view   | null   |
| 2       | 4       | 2019-07-04  | report | spam   |
| 3       | 4       | 2019-07-04  | view   | null   |
| 3       | 4       | 2019-07-04  | report | spam   |
| 4       | 3       | 2019-07-02  | view   | null   |
| 4       | 3       | 2019-07-02  | report | spam   |
| 5       | 2       | 2019-07-04  | view   | null   |
| 5       | 2       | 2019-07-04  | report | racism |
| 5       | 5       | 2019-07-04  | view   | null   |
| 5       | 5       | 2019-07-04  | report | racism |
+---------+---------+-------------+--------+--------+
Result table:
+---------------+--------------+
| report_reason | report_count |
+---------------+--------------+
| spam          | 1            |
| racism        | 2            |
+---------------+--------------+ 
Note that we only care about report reasons with non zero number of reports.

```mysql
SELECT extra AS report_reason, COUNT( DISTINCT post_id) AS report_count
FROM actions
WHERE action_date='2019-07-04' AND action='report'
GROUP BY extra
```

### 1126. Active Businesses

Table: Events
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| business_id   | int     |
| event_type    | varchar |
| occurences    | int     | 
+---------------+---------+
(business_id, event_type) is the primary key of this table.
Each row in the table logs the info that an event of some type occured at some business for a number of times.

Write an SQL query to find all active businesses.
An active business is a business that has more than one event type with occurences greater than the average occurences of that event type among all businesses.
The query result format is in the following example:
Events table:
+-------------+------------+------------+
| business_id | event_type | occurences |
+-------------+------------+------------+
| 1           | reviews    | 7          |
| 3           | reviews    | 3          |
| 1           | ads        | 11         |
| 2           | ads        | 7          |
| 3           | ads        | 6          |
| 1           | page views | 3          |
| 2           | page views | 12         |
+-------------+------------+------------+
 table:
+-------------+
| business_id |
+-------------+
| 1           |
+-------------+ 
Average for 'reviews', 'ads' and 'page views' are (7+3)/2=5, (11+7+6)/3=8, (3+12)/2=7.5 respectively.
Business with id 1 has 7 'reviews' events (more than 5) and 11 'ads' events (more than 8) so it is an active business.

```mysql
-- 1st submission
/*SELECT business_id
FROM (
    SELECT business_id, event_type, occurences
    FROM events e
    JOIN (
        SELECT event_type AS e_type, AVG(occurences) AS avg_val
        FROM events
        GROUP BY event_type) x
    ON e.event_type=x.e_type AND e.occurences>x.avg_val) y
GROUP BY business_id
HAVING COUNT(*)>1*/

-- 2nd submission
SELECT e1.business_id
FROM
Events e1 LEFT JOIN
(SELECT event_type ,avg(occurences) AS event_avg
FROM Events GROUP BY event_type ) av
ON e1.event_type = av.event_type
GROUP BY business_id
HAVING SUM( CASE WHEN e1.occurences > av.event_avg THEN 1 ELSE 0 END )>1
```

### 1127. User Purchase Platform

Table: Spending
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| user_id     | int     |
| spend_date  | date    |
| platform    | enum    | 
| amount      | int     |
+-------------+---------+
The table logs the spendings history of users that make purchases from an online shopping website which has a desktop and a mobile application.
(user_id, spend_date, platform) is the primary key of this table.
The platform column is an ENUM type of ('desktop', 'mobile').
Write an SQL query to find the total number of users and the total amount spent using mobile only, desktop only and both mobile and desktop together for each date.

The query result format is in the following example:
Spending table:
+---------+------------+----------+--------+
| user_id | spend_date | platform | amount |
+---------+------------+----------+--------+
| 1       | 2019-07-01 | mobile   | 100    |
| 1       | 2019-07-01 | desktop  | 100    |
| 2       | 2019-07-01 | mobile   | 100    |
| 2       | 2019-07-02 | mobile   | 100    |
| 3       | 2019-07-01 | desktop  | 100    |
| 3       | 2019-07-02 | desktop  | 100    |
+---------+------------+----------+--------+
Result table:
+------------+----------+--------------+-------------+
| spend_date | platform | total_amount | total_users |
+------------+----------+--------------+-------------+
| 2019-07-01 | desktop  | 100          | 1           |
| 2019-07-01 | mobile   | 100          | 1           |
| 2019-07-01 | both     | 200          | 1           |
| 2019-07-02 | desktop  | 100          | 1           |
| 2019-07-02 | mobile   | 100          | 1           |
| 2019-07-02 | both     | 0            | 0           |
+------------+----------+--------------+-------------+ 
On 2019-07-01, user 1 purchased using both desktop and mobile, user 2 purchased using mobile only and user 3 purchased using desktop only.
On 2019-07-02, user 2 purchased using mobile only, user 3 purchased using desktop only and no one purchased using both platforms.

```mysql
-- MYSQL
-- use GROUP_CONCAT
SELECT a.spend_date, b.platform, 
    IFNULL(c.total_amount, 0) total_amount,
    IFNULL(c.total_users, 0) total_users
FROM 
    (SELECT DISTINCT spend_date FROM Spending) a
JOIN
(SELECT "desktop" AS platform UNION SELECT "mobile" UNION SELECT "both") b
LEFT JOIN
(
    SELECT spend_date, platform, SUM(amount) total_amount, COUNT(amount) total_users
    FROM (
        SELECT
            user_id,
            spend_date,
            (CASE WHEN LENGTH(GROUP_CONCAT(platform)) = 14 THEN "both" 
                ELSE GROUP_CONCAT(platform) END) platform,
            SUM(amount) amount
        FROM Spending
        GROUP BY user_id, spend_date
    ) p
    GROUP BY spend_date, platform
) c
ON a.spend_date = c.spend_date AND b.platform=c.platform

-- union solution, verbose and slow
/*SELECT s1.spend_date, IFNULL(platform, 'desktop') AS platform,
    IFNULL(total_amount, 0) AS total_amount, IFNULL(total_users, 0) AS total_users
FROM (
    SELECT DISTINCT(spend_date) AS spend_date
    FROM spending) s1
LEFT JOIN (
    SELECT spend_date, 'desktop' AS platform,
        SUM(total_users) AS total_users, SUM(total_amount) AS total_amount
    FROM (
        SELECT spend_date, user_id,
            COUNT(CASE WHEN platform='desktop' THEN user_id END) AS total_users,
            SUM(CASE WHEN platform='desktop' THEN amount END) AS total_amount
        FROM spending
        GROUP BY spend_date, user_id
        HAVING COUNT(DISTINCT platform)=1 AND total_users!=0) x
    GROUP BY spend_date) y
ON s1.spend_date=y.spend_date
UNION
SELECT s1.spend_date, IFNULL(platform, 'mobile') AS platform,
    IFNULL(total_amount, 0) AS total_amount, IFNULL(total_users, 0) AS total_users
FROM (
    SELECT DISTINCT(spend_date) AS spend_date
    FROM spending) s1
LEFT JOIN (
    SELECT spend_date, 'mobile' AS platform,
        SUM(total_users) AS total_users, SUM(total_amount) AS total_amount
    FROM (
        SELECT spend_date, user_id,
            COUNT(CASE WHEN platform='mobile' THEN user_id END) AS total_users,
            SUM(CASE WHEN platform='mobile' THEN amount END) AS total_amount
        FROM spending
        GROUP BY spend_date, user_id
        HAVING COUNT(DISTINCT platform)=1 AND total_users!=0) x
    GROUP BY spend_date) y
ON s1.spend_date=y.spend_date
UNION
SELECT s1.spend_date, IFNULL(platform, 'both') AS platform,
    IFNULL(total_amount, 0) AS total_amount, IFNULL(total_users, 0) AS total_users
FROM (
    SELECT DISTINCT(spend_date) AS spend_date
    FROM spending) s1
LEFT JOIN (
    SELECT s.spend_date, 'both' AS platform, COUNT(DISTINCT s.user_id) AS total_users, SUM(s.amount) AS total_amount
    FROM spending s
    JOIN (
        SELECT spend_date, user_id
        FROM spending
        GROUP BY spend_date, user_id
        HAVING COUNT(DISTINCT platform)>1) x
    ON s.spend_date=x.spend_date AND s.user_id=x.user_id
    GROUP BY spend_date) y
ON s1.spend_date=y.spend_date
ORDER BY spend_date, platform*/
-- SQL server
SELECT date_platform.spend_date, date_platform.platform,
    SUM(CASE WHEN amount IS NULL THEN 0 ELSE amount END) as total_amount,
    COUNT(DISTINCT user_id) AS total_users
FROM(
    SELECT * FROM
    (SELECT distinct(spend_date) FROM spending) a
    CROSS JOIN
    (SELECT distinct(platform) FROM spending union select 'both') b ) date_platform
LEFT JOIN(
    SELECT user_id, spend_date, platform, amount,
    (CASE WHEN cnt_platform=1 THEN platform ELSE 'both' END) AS platform1
    FROM(
        SELECT user_id, spend_date, platform, amount, count(*) over(partition by spend_date, user_id) as cnt_platform
        FROM spending) temp
    ) temp1
ON date_platform.spend_date = temp1.spend_date
    AND date_platform.platform = temp1.platform1
GROUP BY date_platform.spend_date, date_platform.platform
ORDER BY date_platform.spend_date;
```

### 1132. Reported Posts II

Table: Actions
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| user_id       | int     |
| post_id       | int     |
| action_date   | date    |
| action        | enum    |
| extra         | varchar |
+---------------+---------+
There is no primary key for this table, it may have duplicate rows.
The action column is an ENUM type of ('view', 'like', 'reaction', 'comment', 'report', 'share').
The extra column has optional information about the action such as a reason for report or a type of reaction. 
Table: Removals
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| post_id       | int     |
| remove_date   | date    | 
+---------------+---------+
post_id is the primary key of this table.
Each row in this table indicates that some post was removed as a result of being reported or as a result of an admin review.

Write an SQL query to find the average for daily percentage of posts that got removed after being reported as spam, rounded to 2 decimal places.
The query result format is in the following example:
Actions table:
+---------+---------+-------------+--------+--------+
| user_id | post_id | action_date | action | extra  |
+---------+---------+-------------+--------+--------+
| 1       | 1       | 2019-07-01  | view   | null   |
| 1       | 1       | 2019-07-01  | like   | null   |
| 1       | 1       | 2019-07-01  | share  | null   |
| 2       | 2       | 2019-07-04  | view   | null   |
| 2       | 2       | 2019-07-04  | report | spam   |
| 3       | 4       | 2019-07-04  | view   | null   |
| 3       | 4       | 2019-07-04  | report | spam   |
| 4       | 3       | 2019-07-02  | view   | null   |
| 4       | 3       | 2019-07-02  | report | spam   |
| 5       | 2       | 2019-07-03  | view   | null   |
| 5       | 2       | 2019-07-03  | report | racism |
| 5       | 5       | 2019-07-03  | view   | null   |
| 5       | 5       | 2019-07-03  | report | racism |
+---------+---------+-------------+--------+--------+
Removals table:
+---------+-------------+
| post_id | remove_date |
+---------+-------------+
| 2       | 2019-07-20  |
| 3       | 2019-07-18  |
+---------+-------------+
Result table:
+-----------------------+
| average_daily_percent |
+-----------------------+
| 75.00                 |
+-----------------------+
The percentage for 2019-07-04 is 50% because only one post of two spam reported posts was removed.
The percentage for 2019-07-02 is 100% because one post was reported as spam and it was removed.
The other days had no spam reports so the average is (50 + 100) / 2 = 75%
Note that the output is only one number and that we do not care about the remove dates.

```mysql
SELECT Round(AVG(A.rate) *100,2) as average_daily_percent
FROM (
    SELECT action_date, COUNT(DISTINCT r.post_id)/ COUNT(DISTINCT a.post_id) AS rate
    FROM Actions a
    LEFT JOIN Removals r
    ON a.post_id=r.post_id
    WHERE ACTION='report' AND extra='spam'
    GROUP BY action_date) A

/*SELECT ROUND(AVG(daily_percent), 2) AS average_daily_percent 
FROM (
    SELECT action_date, SUM(spam)/COUNT(spam)*100 AS daily_percent
    FROM (
        SELECT action_date, CASE WHEN r.post_id IS NULL THEN 0 ELSE 1 END AS spam, a.extra
        FROM (
            SELECT  * FROM actions
            WHERE action='report' AND extra='spam') a
        LEFT JOIN removals r
        ON a.post_id=r.post_id) b
    GROUP BY action_date) c */
```

### 1141. User Activity for the Past 30 Days I

Table: Activity
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| user_id       | int     |
| session_id    | int     |
| activity_date | date    |
| activity_type | enum    |
+---------------+---------+
There is no primary key for this table, it may have duplicate rows.
The activity_type column is an ENUM of type ('open_session', 'end_session', 'scroll_down', 'send_message').
The table shows the user activities for a social media website. 
Note that each session belongs to exactly one user.

Write an SQL query to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. A user was active on some day if he/she made at least one activity on that day.
The query result format is in the following example:
Activity table:
+---------+------------+---------------+---------------+
| user_id | session_id | activity_date | activity_type |
+---------+------------+---------------+---------------+
| 1       | 1          | 2019-07-20    | open_session  |
| 1       | 1          | 2019-07-20    | scroll_down   |
| 1       | 1          | 2019-07-20    | end_session   |
| 2       | 4          | 2019-07-20    | open_session  |
| 2       | 4          | 2019-07-21    | send_message  |
| 2       | 4          | 2019-07-21    | end_session   |
| 3       | 2          | 2019-07-21    | open_session  |
| 3       | 2          | 2019-07-21    | send_message  |
| 3       | 2          | 2019-07-21    | end_session   |
| 4       | 3          | 2019-06-25    | open_session  |
| 4       | 3          | 2019-06-25    | end_session   |
+---------+------------+---------------+---------------+
Result table:
+------------+--------------+ 
| day        | active_users |
+------------+--------------+ 
| 2019-07-20 | 2            |
| 2019-07-21 | 2            |
+------------+--------------+ 
Note that we do not care about days with zero active users.

```mysql
SELECT activity_date AS day, COUNT(DISTINCT user_id) AS active_users
FROM Activity
WHERE activity_date BETWEEN '2019-06-28' AND '2019-07-27'
GROUP BY activity_date
HAVING active_users>0
```

### 1142. User Activity for the Past 30 Days II

Table: Activity
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| user_id       | int     |
| session_id    | int     |
| activity_date | date    |
| activity_type | enum    |
+---------------+---------+
There is no primary key for this table, it may have duplicate rows.
The activity_type column is an ENUM of type ('open_session', 'end_session', 'scroll_down', 'send_message').
The table shows the user activities for a social media website.
Note that each session belongs to exactly one user.

Write an SQL query to find the average number of sessions per user for a period of 30 days ending 2019-07-27 inclusively, rounded to 2 decimal places. The sessions we want to count for a user are those with at least one activity in that time period.
The query result format is in the following example:
Activity table:
+---------+------------+---------------+---------------+
| user_id | session_id | activity_date | activity_type |
+---------+------------+---------------+---------------+
| 1       | 1          | 2019-07-20    | open_session  |
| 1       | 1          | 2019-07-20    | scroll_down   |
| 1       | 1          | 2019-07-20    | end_session   |
| 2       | 4          | 2019-07-20    | open_session  |
| 2       | 4          | 2019-07-21    | send_message  |
| 2       | 4          | 2019-07-21    | end_session   |
| 3       | 2          | 2019-07-21    | open_session  |
| 3       | 2          | 2019-07-21    | send_message  |
| 3       | 2          | 2019-07-21    | end_session   |
| 3       | 5          | 2019-07-21    | open_session  |
| 3       | 5          | 2019-07-21    | scroll_down   |
| 3       | 5          | 2019-07-21    | end_session   |
| 4       | 3          | 2019-06-25    | open_session  |
| 4       | 3          | 2019-06-25    | end_session   |
+---------+------------+---------------+---------------+
Result table:
+---------------------------+ 
| average_sessions_per_user |
+---------------------------+ 
| 1.33                      |
+---------------------------+ 
User 1 and 2 each had 1 session in the past 30 days while user 3 had 2 sessions so the average is (1 + 1 + 2) / 3 = 1.33.

```mysql
SELECT ROUND(IFNULL(AVG(n_sessions), 0.0), 2) AS average_sessions_per_user
FROM (
    SELECT activity_date, COUNT(DISTINCT session_id) AS n_sessions
    FROM Activity
    WHERE activity_date BETWEEN '2019-06-28' AND '2019-07-27'
    GROUP BY user_id) x
```

### 1148. Article Views I

Table: Views
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| article_id    | int     |
| author_id     | int     |
| viewer_id     | int     |
| view_date     | date    |
+---------------+---------+
There is no primary key for this table, it may have duplicate rows.
Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
Note that equal author_id and viewer_id indicate the same person.

Write an SQL query to find all the authors that viewed at least one of their own articles, sorted in ascending order by their id.
The query result format is in the following example:
Views table:
+------------+-----------+-----------+------------+
| article_id | author_id | viewer_id | view_date  |
+------------+-----------+-----------+------------+
| 1          | 3         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |
+------------+-----------+-----------+------------+
Result table:
+------+
| id   |
+------+
| 4    |
| 7    |
+------+

```mysql
SELECT DISTINCT author_id AS id
FROM views
WHERE author_id=viewer_id
ORDER BY author_id
```

### 1149. Article Views II

Table: Views
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| article_id    | int     |
| author_id     | int     |
| viewer_id     | int     |
| view_date     | date    |
+---------------+---------+
There is no primary key for this table, it may have duplicate rows.
Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
Note that equal author_id and viewer_id indicate the same person.

Write an SQL query to find all the people who viewed more than one article on the same date, sorted in ascending order by their id.
The query result format is in the following example:
Views table:
+------------+-----------+-----------+------------+
| article_id | author_id | viewer_id | view_date  |
+------------+-----------+-----------+------------+
| 1          | 3         | 5         | 2019-08-01 |
| 3          | 4         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |
+------------+-----------+-----------+------------+
Result table:
+------+
| id   |
+------+
| 5    |
| 6    |
+------+

```mysql
-- one query, more concise
SELECT DISTINCT(viewer_id) AS id
FROM views
GROUP BY viewer_id, view_date
HAVING COUNT(DISTINCT article_id)>1
ORDER BY viewer_id

/* SELECT DISTINCT viewer_id AS id
FROM
(
    SELECT viewer_id, view_date, COUNT(DISTINCT article_id) AS articles
    FROM views
    GROUP BY viewer_id, view_date
    HAVING articles>1) a
ORDER BY viewer_id */
```

### 1158. Market Analysis I

Table: Users
+----------------+---------+
| Column Name    | Type    |
+----------------+---------+
| user_id        | int     |
| join_date      | date    |
| favorite_brand | varchar |
+----------------+---------+
user_id is the primary key of this table.
This table has the info of the users of an online shopping website where users can sell and buy items.
Table: Orders
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| order_id      | int     |
| order_date    | date    |
| item_id       | int     |
| buyer_id      | int     |
| seller_id     | int     |
+---------------+---------+
order_id is the primary key of this table.
item_id is a foreign key to the Items table.
buyer_id and seller_id are foreign keys to the Users table.
Table: Items
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| item_id       | int     |
| item_brand    | varchar |
+---------------+---------+
item_id is the primary key of this table.

Write an SQL query to find for each user, the join date and the number of orders they made as a buyer in 2019.
The query result format is in the following example:
Users table:
+---------+------------+----------------+
| user_id | join_date  | favorite_brand |
+---------+------------+----------------+
| 1       | 2018-01-01 | Lenovo         |
| 2       | 2018-02-09 | Samsung        |
| 3       | 2018-01-19 | LG             |
| 4       | 2018-05-21 | HP             |
+---------+------------+----------------+
Orders table:
+----------+------------+---------+----------+-----------+
| order_id | order_date | item_id | buyer_id | seller_id |
+----------+------------+---------+----------+-----------+
| 1        | 2019-08-01 | 4       | 1        | 2         |
| 2        | 2018-08-02 | 2       | 1        | 3         |
| 3        | 2019-08-03 | 3       | 2        | 3         |
| 4        | 2018-08-04 | 1       | 4        | 2         |
| 5        | 2018-08-04 | 1       | 3        | 4         |
| 6        | 2019-08-05 | 2       | 2        | 4         |
+----------+------------+---------+----------+-----------+
Items table:
+---------+------------+
| item_id | item_brand |
+---------+------------+
| 1       | Samsung    |
| 2       | Lenovo     |
| 3       | LG         |
| 4       | HP         |
+---------+------------+
Result table:
+-----------+------------+----------------+
| buyer_id  | join_date  | orders_in_2019 |
+-----------+------------+----------------+
| 1         | 2018-01-01 | 1              |
| 2         | 2018-02-09 | 2              |
| 3         | 2018-01-19 | 0              |
| 4         | 2018-05-21 | 0              |
+-----------+------------+----------------+

```mysql
/* SELECT u.user_id AS buyer_id, u.join_date, IFNULL(x.orders, 0) AS orders_in_2019
FROM users u
LEFT JOIN (
    SELECT buyer_id, COUNT(order_id) AS orders
    FROM orders
    WHERE year(order_date)=2019
    GROUP BY buyer_id) x
ON u.user_id=x.buyer_id*/
-- faster solution
SELECT u.user_id as buyer_id , u.join_date,
    SUM(CASE WHEN YEAR(o.order_date) =2019 THEN 1 ELSE 0 END) as orders_in_2019
FROM Orders as o
RIGHT JOIN Users as u
ON o.buyer_id = u.user_id
GROUP BY u.user_id
```

### 1159. Market Analysis II

Table: Users
+----------------+---------+
| Column Name    | Type    |
+----------------+---------+
| user_id        | int     |
| join_date      | date    |
| favorite_brand | varchar |
+----------------+---------+
user_id is the primary key of this table.
This table has the info of the users of an online shopping website where users can sell and buy items.
Table: Orders
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| order_id      | int     |
| order_date    | date    |
| item_id       | int     |
| buyer_id      | int     |
| seller_id     | int     |
+---------------+---------+
order_id is the primary key of this table.
item_id is a foreign key to the Items table.
buyer_id and seller_id are foreign keys to the Users table.
Table: Items
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| item_id       | int     |
| item_brand    | varchar |
+---------------+---------+
item_id is the primary key of this table.

Write an SQL query to find for each user, whether the brand of the second item (by date) they sold is their favorite brand. If a user sold less than two items, report the answer for that user as no.

It is guaranteed that no seller sold more than one item on a day.
The query result format is in the following example:
Users table:
+---------+------------+----------------+
| user_id | join_date  | favorite_brand |
+---------+------------+----------------+
| 1       | 2019-01-01 | Lenovo         |
| 2       | 2019-02-09 | Samsung        |
| 3       | 2019-01-19 | LG             |
| 4       | 2019-05-21 | HP             |
+---------+------------+----------------+
Orders table:
+----------+------------+---------+----------+-----------+
| order_id | order_date | item_id | buyer_id | seller_id |
+----------+------------+---------+----------+-----------+
| 1        | 2019-08-01 | 4       | 1        | 2         |
| 2        | 2019-08-02 | 2       | 1        | 3         |
| 3        | 2019-08-03 | 3       | 2        | 3         |
| 4        | 2019-08-04 | 1       | 4        | 2         |
| 5        | 2019-08-04 | 1       | 3        | 4         |
| 6        | 2019-08-05 | 2       | 2        | 4         |
+----------+------------+---------+----------+-----------+
Items table:
+---------+------------+
| item_id | item_brand |
+---------+------------+
| 1       | Samsung    |
| 2       | Lenovo     |
| 3       | LG         |
| 4       | HP         |
+---------+------------+
Result table:
+-----------+--------------------+
| seller_id | 2nd_item_fav_brand |
+-----------+--------------------+
| 1         | no                 |
| 2         | yes                |
| 3         | yes                |
| 4         | no                 |
+-----------+--------------------+
The answer for the user with id 1 is no because they sold nothing.
The answer for the users with id 2 and 3 is yes because the brands of their second sold items are their favorite brands.
The answer for the user with id 4 is no because the brand of their second sold item is not their favorite brand.

```mysql
-- SQL server
SELECT u.user_id AS seller_id,
    CASE WHEN u.favorite_brand=a.item_brand THEN 'yes' ELSE 'no' END AS '2nd_item_fav_brand'
FROM users u
LEFT JOIN 
    (SELECT buyer_id, seller_id, i.item_brand,
        RANK() OVER (PARTITION BY seller_id ORDER BY order_date) AS rnk
    FROM orders as o
    JOIN items i
    ON o.item_id = i.item_id) a
ON u.user_id=a.seller_id AND a.rnk=2
```

### 1164. Product Price at a Given Date

Table: Products
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| product_id    | int     |
| new_price     | int     |
| change_date   | date    |
+---------------+---------+
(product_id, change_date) is the primary key of this table.
Each row of this table indicates that the price of some product was changed to a new price at some date.

Write an SQL query to find the prices of all products on 2019-08-16. Assume the price of all products before any change is 10.
The query result format is in the following example:
Products table:
+------------+-----------+-------------+
| product_id | new_price | change_date |
+------------+-----------+-------------+
| 1          | 20        | 2019-08-14  |
| 2          | 50        | 2019-08-14  |
| 1          | 30        | 2019-08-15  |
| 1          | 35        | 2019-08-16  |
| 2          | 65        | 2019-08-17  |
| 3          | 20        | 2019-08-18  |
+------------+-----------+-------------+
Result table:
+------------+-------+
| product_id | price |
+------------+-------+
| 2          | 50    |
| 1          | 35    |
| 3          | 10    |
+------------+-------+

```mysql
SELECT id.product_id, IFNULL(b.new_price, 10) AS price
FROM (
    SELECT DISTINCT product_id
    FROM products) id
LEFT JOIN (
    SELECT p.product_id, p.new_price, p.change_date
    FROM products p
    JOIN (
        SELECT product_id, MAX(change_date) as change_date
        FROM products
        WHERE change_date<='2019-08-16'
        GROUP BY product_id) a
    ON p.product_id=a.product_id AND p.change_date=a.change_date) b
ON id.product_id=b.product_id
```